---
kind: method
id: M:Autodesk.Revit.DB.OBJExportOptions.IsValidForGridAspectRatio(System.Double)
source: html/c68db8c2-48d0-8b2b-7034-9ce2640206a7.htm
---
# Autodesk.Revit.DB.OBJExportOptions.IsValidForGridAspectRatio Method

Checks whether the value is allowed (is in the allowed range) for GridAspectRatio tessellation parameter.

## Syntax (C#)
```csharp
public static bool IsValidForGridAspectRatio(
	double value
)
```

## Parameters
- **value** (`System.Double`) - The value to be checked.

## Returns
True if the value is valid for GridAspectRatio, false otherwise.